1. Seleccionar las columnas “Survived”, “Pclass”, “Age” y “Sex”.

2. Seleccionar las filas 200 a 400 de las columnas “Name” y “Age”.

3. Seleccionar las últimas 120 filas de las últimas tres columnas.

4. Seleccionar todos los datos de los sobrevivientes.

5. Seleccionar los nombres de los menores de 18 años.

6. Seleccionar las edades de las mujeres.

In [3]:
#1
import pandas as pd
data = pd.read_csv("titanic.csv")

data[["Survived", "Pclass", "Age", "Sex"]]

     Survived  Pclass   Age     Sex
0           0       3  22.0    male
1           1       1  38.0  female
2           1       3  26.0  female
3           1       1  35.0  female
4           0       3  35.0    male
..        ...     ...   ...     ...
886         0       2  27.0    male
887         1       1  19.0  female
888         0       3   NaN  female
889         1       1  26.0    male
890         0       3  32.0    male

[891 rows x 4 columns]

In [10]:
#2
data.loc[200:400, ["Name", "Age"]]

                                 Name   Age
200    Vande Walle, Mr. Nestor Cyriel  28.0
201               Sage, Mr. Frederick   NaN
202        Johanson, Mr. Jakob Alfred  34.0
203              Youseff, Mr. Gerious  45.5
204          Cohen, Mr. Gurshon "Gus"  18.0
..                                ...   ...
396               Olsson, Miss. Elina  31.0
397           McKane, Mr. Peter David  46.0
398                  Pain, Dr. Alfred  23.0
399  Trout, Mrs. William H (Jessie L)  28.0
400                Niskanen, Mr. Juha  39.0

[201 rows x 2 columns]

In [15]:
#3
data.iloc[-120:, -3:]

        Fare Cabin Embarked
771   7.8542   NaN        S
772  10.5000   E77        S
773   7.2250   NaN        C
774  23.0000   NaN        S
775   7.7500   NaN        S
..       ...   ...      ...
886  13.0000   NaN        S
887  30.0000   B42        S
888  23.4500   NaN        S
889  30.0000  C148        C
890   7.7500   NaN        Q

[120 rows x 3 columns]

In [19]:
#4
data[["Survived"]]

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [21]:
#5
data.loc[data["Age"]<18, ["Name"]]

                                        Name
7             Palsson, Master. Gosta Leonard
9        Nasser, Mrs. Nicholas (Adele Achem)
10           Sandstrom, Miss. Marguerite Rut
14      Vestrom, Miss. Hulda Amanda Adolfina
16                      Rice, Master. Eugene
..                                       ...
850  Andersson, Master. Sigvard Harald Elias
852                  Boulos, Miss. Nourelain
853                Lines, Miss. Mary Conover
869          Johnson, Master. Harold Theodor
875         Najib, Miss. Adele Kiamie "Jane"

[113 rows x 1 columns]

In [23]:
#6
data.loc[data["Sex"]=="female", ["Age"]]

      Age
1    38.0
2    26.0
3    35.0
8    27.0
9    14.0
..    ...
880  25.0
882  22.0
885  39.0
887  19.0
888   NaN

[314 rows x 1 columns]